import { ICategory } from '@app-types';

export const categories: ICategory[] = [
  { id: 1, name: 'Личный блог', color: '#FF9800' }, // Оранжевый
  { id: 2, name: 'Образование', color: '#2196F3' }, // Голубой
  { id: 3, name: 'Бизнес', color: '#4CAF50' }, // Зеленый
  { id: 4, name: 'Литература', color: '#795548' }, // Коричневый
  { id: 5, name: 'Музыка', color: '#e036cf' }, // Розовый
  { id: 6, name: 'Игры и киберспорт', color: 'red' }, // Красный
  { id: 7, name: 'Кино', color: '#673AB7' }, // Темно-фиолетовый
  { id: 8, name: 'Творчество', color: '#79608f' }, // Сливововый
  { id: 9, name: 'Туризм и путешествия', color: '#ff911c' }, // Коралловый
  { id: 10, name: 'Кулинария', color: '#FF5722' }, // Оранжево-красный
  { id: 11, name: 'Спорт и здоровье', color: '#8BC34A' }, // Светло-зеленый
  { id: 12, name: 'СМИ', color: '#aba800' }, // Темно-Желтый
  { id: 13, name: 'Стиль и мода', color: '#ad2828' }, // Бордовый
  { id: 14, name: 'Отношения', color: '#FF4081' }, // Малиновый
  { id: 15, name: 'IT и инновации', color: '#12A193' }, // Бирюзовый
  { id: 16, name: 'Техника и электроника', color: '#607D8B' }, // Серый
  { id: 17, name: 'Наука', color: '#234acc' }, // Синий
];
