export const testChannelProps = [
  {
    id: 1,
    ownerId: 1,
    name: 'Канал о туризме с большой буквы',
    description:
      'Добро пожаловать в мир путешествий, приключений и незабываемых впечатлений! Наш туристический канал создан для всех, ' +
      'кто мечтает открыть для себя самые удивительные уголки планеты, ' +
      'вдохновиться культурным многообразием и получить полезные советы для комфортных и увлекательных поездок.',
    subsCount: 100,
    // imageURL: 'https://via.placeholder.com/150',
  },
];
